# Plant_GetToolInit

## Description
Returns true if the plant tool is initialized.

```pascal
FUNCTION Plant_GetToolInit : BOOLEAN;
```

```python

def vs.Plant_GetToolInit():
    return BOOLEAN
```

## Version
Availability: from Vectorworks 2014
## Category
* PlantObjectCoreTools